app/views/static_pages/order.html.erb

      <tr>
        <td><%= link_to "#{Developer.find_by(id: dev_id).name}", developer_path(Developer.find_by(id: dev_id)) %></td>
---
SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]