app/views/static_pages/tally.html.erb

SELECT COUNT(*) FROM "fans" WHERE "fans"."game_id" = ?  [["game_id", 1]]
---
        <td><%= link_to "#{game.title}", game_path(game) %></td>
        <td><%= game.fans.count %></td>