app/views/fans/_form.html.erb

SELECT "games".* FROM "games"
---
    <%= f.label "Vote for your favorite Game" %>
    <%= f.collection_select(:game_id, Game.all, :id, :title)%>