app/controllers/application_controller.rb

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def current_dev
    session[:dev_id].nil? ? nil : Developer.find(session[:dev_id])