app/controllers/developers_controller.rb

INSERT INTO "developers" ("name", "employees", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Test Developer"], ["employees", 7], ["location", "Motown"], ["created_at", "2018-06-27 18:48:17.014246"], ["updated_at", "2018-06-27 18:48:17.014246"]]
---
  def create
    @developer = Developer.new(developer_params)
    if @developer.save

SELECT "developers".* FROM "developers"
---
  def index
    @developers = Developer.all

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_developer
      @developer = Developer.find(params[:id])