app/controllers/fans_controller.rb

  def create
    @fan = Fan.new(fan_params)
    respond_to do |format|
      if @fan.save
---
INSERT INTO "fans" ("name", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Fan1"], ["game_id", 4], ["created_at", "2018-07-02 18:13:36.015954"], ["updated_at", "2018-07-02 18:13:36.015954"]]

  def index
    @fans = Fan.all
---
SELECT "fans".* FROM "fans"