app/controllers/games_controller.rb

INSERT INTO "games" ("title", "description", "genre", "price", "developer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @game = Game.new(game_params)
    respond_to do |format|
      if @game.save

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
    @game = Game.find(params[:id])

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def index
    if params[:developer_id]
      @games = Developer.find(params[:developer_id]).games
      respond_to do |format|
				format.html {render :index}
				format.json {render json: @games}
			end
    else
      @games = Game.all