app/controllers/sessions_controller.rb

SELECT  "developers".* FROM "developers" WHERE (2) LIMIT ?  [["LIMIT", 1]]
---
  def new
    @dev = Developer.new
    @devs = Developer.all

SELECT  "developers".* FROM "developers" WHERE "developers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    # w/ OAUTH
    if auth_hash = request.env["omniauth.auth"]
      @dev = Developer.from_omniauth(request.env["omniauth.auth"])
      if @dev.valid?
        session[:dev_id] = @dev.id
      end
    end
    if session[:dev_id] == nil # If session does not exist must be regular login
      @dev = Developer.find_by(id: params[:developer][:id])