app/controllers/static_pages_controller.rb

  def tally
    @games = Game.all
    @devs = Developer.all
---
SELECT "games".* FROM "games"
SELECT "developers".* FROM "developers"