app/models/developer.rb

SELECT  "developers".* FROM "developers" WHERE "developers"."uid" = ? ORDER BY "developers"."id" ASC LIMIT ?  [["uid", "29718714"], ["LIMIT", 1]]
INSERT INTO "developers" ("id", "name", "employees", "location", "created_at", "updated_at", "password_digest", "uid") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "developers" SET "password_digest" = ?, "employees" = ?, "location" = ?, "updated_at" = ? WHERE "developers"."id" = ?  [["password_digest", "$2a$10$if4egRRFetVVFAPidbhw0uYUV3H0uQw42SZte6WZ/kzoo3u1inbAq"], ["employees", 1], ["location", "GitHub"], ["updated_at", "2018-07-13 21:12:15.756586"], ["id", 29718714]]
---
  def self.from_omniauth(auth)
    where(uid: auth.uid).first_or_initialize.tap do |dev|
      dev.id = auth.uid
      dev.password = 'tester'
      dev.name = 'GithubProfile'
      dev.employees = 1
      dev.location = 'GitHub'
      dev.save!